notes/org_roam.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-roam</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://www.haider.gq/base/table.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">Org-roam</h1>

<div id="outline-container-orgd30ce4c" class="outline-2">
<h2 id="orgd30ce4c">About</h2>
<div class="outline-text-2" id="text-orgd30ce4c">
<p>
One of the best ways to think and work through problems is to have a written dialogue with yourself. Using Org-roam you have a better way to log your thoughts from the day, link them to existing notes, and easily review the notes for any day, all with Org Roam.
I use Org-roam as a place I can place information in my eternal quest for knowledge.
Org-roam is built over <a href="org_mode.html#ID-31075352-280e-4ef1-978e-5c189da43657">org-mode</a> (That's partially what makes it so awesome).
</p>
</div>
</div>

<div id="outline-container-org5247a35" class="outline-2">
<h2 id="org5247a35">Documentation</h2>
<div class="outline-text-2" id="text-org5247a35">
<p>
You can get documentation from these links:
<a target='_blank' rel='noopener noreferrer' class='external' href="https://www.org-roam.com/manual.html">Main Documentation</a>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://systemcrafters.cc/build-a-second-brain-in-emacs/getting-started-with-org-roam/">Get Started with Org-roam - Systemcrafters</a>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://systemcrafters.net/build-a-second-brain-in-emacs/capturing-notes-efficiently/">Capturing notes efficiently with Org Roam - Systemcrafters</a>
</p>
</div>
</div>

<div id="outline-container-org5d794be" class="outline-2">
<h2 id="org5d794be">NOTE:</h2>
<div class="outline-text-2" id="text-org5d794be">
<p>
To install, make sure you have gcc AND gcc-toolchain (If you use <a href="guix.html#ID-4ce84157-a404-40fa-bdb8-0b3923916969">Guix</a>) installed.
</p>
</div>
</div>

<div id="outline-container-org55886ba" class="outline-2">
<h2 id="org55886ba">Important information</h2>
<div class="outline-text-2" id="text-org55886ba">
<ul class="org-ul">
<li>In my configuration my Org roam notes go to the <b>~/Notes/</b> directory.</li>
<li>Video where I got the information is as follows: <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.youtube.com/watch?v=3-sLBaJAtew&amp;list=WL&amp;index=14&amp;t=39s">Video</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4d11df4" class="outline-2">
<h2 id="org4d11df4">Inserting node links using completions</h2>
<div class="outline-text-2" id="text-org4d11df4">
<p>
You can also use <b>M-x completion-at-point</b> to complete the names of nodes inside of double-square brackets <b>[[]]</b>.
</p>
</div>
</div>
<div id="outline-container-org7889786" class="outline-2">
<h2 id="org7889786">Keybinds</h2>
<div class="outline-text-2" id="text-org7889786">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybind</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC - orf</td>
<td class="org-left">find a Org-roam note</td>
</tr>

<tr>
<td class="org-left">SPC - orc</td>
<td class="org-left">creates a Org-roam note</td>
</tr>

<tr>
<td class="org-left">SPC - ori</td>
<td class="org-left">insert a link to a Org-roam note</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb725212" class="outline-2">
<h2 id="orgb725212">Links to this note</h2>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:haider@haider.gq'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgmode in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
